app/views/tasks/edit.html.erb

SELECT `buckets`.* FROM `buckets` ORDER BY `buckets`.`name` ASC
---
    <br><%= f.label "Bucket"%>
    <%= f.collection_select :bucket_id, Bucket.order(:name),:id, :name %><br>