app/views/buckets/show.html.erb

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`bucket_id` = 1
---
<ul>
    <% @bucket.tasks_by_status("Pending").each do |task| %>