app/views/courses/show.html.erb

SELECT `sections`.* FROM `sections` WHERE `sections`.`course_id` = 14
SELECT 1 AS one FROM `sections` WHERE `sections`.`course_id` = 14 LIMIT 1
---
<% unless current_user_role == nil %>
  <% if @course.sections.any? %>

SELECT `sections`.* FROM `sections` WHERE `sections`.`course_id` = 14
---
  <% end %>
  <% @course.sections.each do |section| %>

SELECT `assignments`.* FROM `assignments` WHERE `assignments`.`section_id` = 1
---
    </h4>
    <% section.assignments.each do |assignment| %>