app/controllers/assignments_controller.rb

  def show
    @course = Course.find(params[:course_id])
    @section = @course.sections.find(params[:section_id])
    @assignment = @section.assignments.find(params[:id])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 13 LIMIT 1
SELECT `sections`.* FROM `sections` WHERE `sections`.`course_id` = 13 AND `sections`.`id` = 1 LIMIT 1
SELECT `assignments`.* FROM `assignments` WHERE `assignments`.`section_id` = 1 AND `assignments`.`id` = 2 LIMIT 1

  def new
    @course = Course.find(params[:course_id])
    @section = @course.sections.find(params[:section_id])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 13 LIMIT 1
SELECT `sections`.* FROM `sections` WHERE `sections`.`course_id` = 13 AND `sections`.`id` = 3 LIMIT 1

  def create
    @course = Course.find(params[:course_id])
    @section = @course.sections.find(params[:section_id])
    @assignment = @section.assignments.create(assignment_params)
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 14 LIMIT 1
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 2 LIMIT 1
SELECT `sections`.* FROM `sections` WHERE `sections`.`course_id` = 14 AND `sections`.`id` = 12 LIMIT 1
INSERT INTO `assignments` (`title`, `description`, `opendate`, `closedate`, `section_id`, `created_at`, `updated_at`) VALUES ('a test assignment', 'here you go', '2024-05-15 14:58:00', '2024-05-24 14:59:00', 12, '2024-05-08 18:59:05.898961', '2024-05-08 18:59:05.898961')

  def edit
    @course = Course.find(params[:course_id])
    @section = @course.sections.find(params[:section_id])
    @assignment = @section.assignments.find(params[:id])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 13 LIMIT 1
SELECT `sections`.* FROM `sections` WHERE `sections`.`course_id` = 13 AND `sections`.`id` = 1 LIMIT 1
SELECT `assignments`.* FROM `assignments` WHERE `assignments`.`section_id` = 1 AND `assignments`.`id` = 2 LIMIT 1

  def update
    @course = Course.find(params[:course_id])
    @section = @course.sections.find(params[:section_id])
    @assignment = @section.assignments.find(params[:id])
    if @assignment.update(assignment_params)
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 13 LIMIT 1
SELECT `sections`.* FROM `sections` WHERE `sections`.`course_id` = 13 AND `sections`.`id` = 1 LIMIT 1
SELECT `assignments`.* FROM `assignments` WHERE `assignments`.`section_id` = 1 AND `assignments`.`id` = 2 LIMIT 1
UPDATE `assignments` SET `assignments`.`title` = 'Read JSTOR article!', `assignments`.`updated_at` = '2024-05-08 19:22:37.003178' WHERE `assignments`.`id` = 2

  def destroy
    @course = Course.find(params[:course_id])
    @section = @course.sections.find(params[:section_id])
    @assignment = @section.assignments.find(params[:id])
    @assignment.destroy
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 13 LIMIT 1
SELECT `sections`.* FROM `sections` WHERE `sections`.`course_id` = 13 AND `sections`.`id` = 1 LIMIT 1
SELECT `assignments`.* FROM `assignments` WHERE `assignments`.`section_id` = 1 AND `assignments`.`id` = 4 LIMIT 1
DELETE FROM `assignments` WHERE `assignments`.`id` = 4

    def require_enrolled!
      @course = Course.find(params[:course_id])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 13 LIMIT 1

    def require_instructor_on_page!
      @course = Course.find(params[:course_id])
      @section = @course.sections.find(params[:section_id])
      @assignment = @section.assignments.find(params[:id])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 13 LIMIT 1
SELECT `sections`.* FROM `sections` WHERE `sections`.`course_id` = 13 AND `sections`.`id` = 1 LIMIT 1
SELECT `assignments`.* FROM `assignments` WHERE `assignments`.`section_id` = 1 AND `assignments`.`id` = 2 LIMIT 1

    def require_instructor_off_page!
      @course = Course.find(params[:course_id])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 14 LIMIT 1