app/controllers/buckets_controller.rb

INSERT INTO `buckets` (`name`, `description`, `status`, `created_at`, `updated_at`) VALUES ('Phyiscs', 'Content related to Physics', NULL, '2024-05-04 19:04:59.824637', '2024-05-04 19:04:59.824637')
UPDATE `buckets` SET `buckets`.`status` = 'Empty', `buckets`.`updated_at` = '2024-05-04 19:04:59.829645' WHERE `buckets`.`id` = 2
---
    def create
        @bucket = Bucket.create(bucket_params(:name, :description))
        @bucket.status = "Empty"
        @bucket.save

SELECT `buckets`.* FROM `buckets` WHERE `buckets`.`id` = 1 LIMIT 1
---
    def show
        @bucket = Bucket.find(params[:id])

SELECT `buckets`.* FROM `buckets` WHERE `buckets`.`id` = 1 LIMIT 1
---
    def edit
        @bucket = Bucket.find(params[:id])

SELECT `buckets`.* FROM `buckets` WHERE `buckets`.`id` = 1 LIMIT 1
UPDATE `buckets` SET `buckets`.`name` = 'Physics', `buckets`.`updated_at` = '2024-05-04 19:05:35.140601' WHERE `buckets`.`id` = 2
---
    def update
        @bucket = Bucket.find(params[:id])
        @bucket.update(bucket_params(:name, :description))

DELETE FROM `buckets` WHERE `buckets`.`id` = 1
SELECT `buckets`.* FROM `buckets` WHERE `buckets`.`id` = 1 LIMIT 1
---
    def destroy
        @bucket = Bucket.find(params[:id]).destroy