app/controllers/courses_controller.rb

SELECT `courses`.* FROM `courses`
---
    def index
        @courses = Course.all

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 14 LIMIT 1
---
    def show
        @course = Course.find(params[:id])

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 13 LIMIT 1
---
    def edit
        @course = Course.find(params[:id])

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 13 LIMIT 1
---
    def update
        @course = Course.find(params[:id])

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 13 LIMIT 1
---
    def enroll
        @course = Course.find(params[:id])

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 13 LIMIT 1
---
        def require_instructor!
            @course = Course.find(params[:id])