app/controllers/sections_controller.rb

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 14 LIMIT 1
INSERT INTO `sections` (`title`, `course_id`, `created_at`, `updated_at`) VALUES ('test', 14, '2024-05-08 18:58:51.869708', '2024-05-08 18:58:51.869708')
---
  def create
    @course = Course.find(params[:course_id])
    @section = @course.sections.create(section_params)

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 13 LIMIT 1
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 14 LIMIT 1
SELECT `sections`.* FROM `sections` WHERE `sections`.`course_id` = 13 AND `sections`.`id` = 14 LIMIT 1
DELETE FROM `sections` WHERE `sections`.`id` = 14
---
  def destroy
    @course = Course.find(params[:course_id])
    @section = @course.sections.find(params[:id])
    @section.destroy

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 13 LIMIT 1
---
    def require_instructor!
        @course = Course.find(params[:course_id])