app/controllers/tasks_controller.rb

    def create
        @task = Task.create(task_params(:name, :description, :bucket_id))
        @task.status = "Pending"
        @task.save
---
INSERT INTO `tasks` (`name`, `description`, `status`, `bucket_id`, `created_at`, `updated_at`) VALUES ('Question1', 'this is question 1', NULL, 3, '2024-05-04 19:06:22.478630', '2024-05-04 19:06:22.478630')
UPDATE `buckets` SET `buckets`.`status` = 'Pending', `buckets`.`updated_at` = '2024-05-04 19:06:22.489335' WHERE `buckets`.`id` = 3
UPDATE `tasks` SET `tasks`.`status` = 'Pending', `tasks`.`updated_at` = '2024-05-04 19:06:22.482269' WHERE `tasks`.`id` = 1

    def show
        @task = Task.find(params[:id])
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1

    def edit
        @task = Task.find(params[:id])
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1