app/controllers/tasks_controller.rb

    def set_user_task
      @user = User.find(params[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1