app/models/bucket.rb

    def self.get_by_status(status)
        self.all.select do |bucket|
---
SELECT `buckets`.* FROM `buckets`

    def update_status
        if self.tasks == []
            self.status = "Empty"
        elsif self.tasks.any?{|task| task.status == "Pending"}
            self.status = "Pending"
        else
            self.status = "Completed"
        end
        self.save
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`bucket_id` = 1
UPDATE `buckets` SET `buckets`.`status` = 'Pending', `buckets`.`updated_at` = '2024-05-04 19:06:22.489335' WHERE `buckets`.`id` = 3

    def tasks_by_status(status)
        self.tasks.select do |task|
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`bucket_id` = 1