app/models/course.rb

    def add_user(new_user, new_role)
        self.enrollments.create(user: new_user, role: new_role)
---
INSERT INTO `enrollments` (`user_id`, `course_id`, `role`, `created_at`, `updated_at`) VALUES (2, 13, 'student', '2024-05-08 18:36:06.635414', '2024-05-08 18:36:06.635414')

    def check_user_role(checked_user)
        unless checked_user == nil
            return self.enrollments.where(user_id: checked_user.id).pick(:role)
---
SELECT `enrollments`.`role` FROM `enrollments` WHERE `enrollments`.`course_id` = 14 AND `enrollments`.`user_id` = 1 LIMIT 1