app/models/task.rb

  def self.get_by_status(status)
    self.all.select do |task|
---
SELECT `tasks`.* FROM `tasks`